/* No comment provided by engineer. */
"%@ to %@" = "%1$@ tielle %2$@";

/* No comment provided by engineer. */
"%d of %d" = "%1$d/%2$d";

/* No comment provided by engineer. */
"%i to %i" = "%1$i–%2$i";

/* No comment provided by engineer. */
"'%@' accumulate attribute is invalid." = "Kumuloitava ominaisuustieto %@ on virheellinen.";

/* No comment provided by engineer. */
"'%@' is an invalid directions time attribute." = "%@ on virheellinen reittiohjeiden ajan ominaisuustieto.";

/* No comment provided by engineer. */
"'%@' is an invalid impedance attribute." = "%@ on virheellinen impedanssin ominaisuustieto.";

/* No comment provided by engineer. */
"'%@' restriction attribute is invalid." = "Rajoituksen ominaisuustieto %@ on virheellinen.";

/* No comment provided by engineer. */
"'item' parameter required" = "item-parametri vaaditaan";

/* No comment provided by engineer. */
"'portal' parameter required" = "portal-parametri vaaditaan";

/* No comment provided by engineer. */
"'tags' parameter required" = "tags-parametri vaaditaan";

/* No comment provided by engineer. */
"'title' parameter required" = "title-parametri vaaditaan";

/* No comment provided by engineer. */
"+/-" = "+/-";

/* No comment provided by engineer. */
"<No value>" = "<Ei arvoa>";

/* No comment provided by engineer. */
"Access to the device location is denied." = "Laitteen sijainnin käyttö on estetty.";

/* No comment provided by engineer. */
"Actual Size" = "Todellinen koko";

/* No comment provided by engineer. */
"Add" = "Lisää";

/* No comment provided by engineer. */
"Add Attachment" = "Lisää liite";

/* No comment provided by engineer. */
"Add..." = "Lisää....";

/* No comment provided by engineer. */
"An itemID is required for this operation. Add this item to the Portal to get an ItemID." = "Tämä toiminto edellyttää itemID-tunnusta. Hanki ItemID-tunnus lisäämällä tämä kohde portaaliin.";

/* No comment provided by engineer. */
"An uncaught NSException was detected, however the original information and callstack is not available. Break on objective-c exceptions to see the line of code causing the original NSException. For more information on how to do this please see the documentation." = "Aiemmin havaitsematon NSException-poikkeus havaittiin, mutta alkuperäiset tiedot ja kutsupino eivät ole käytettävissä. Katkaise objective-c-poikkeusten kohdalla, jos haluat nähdä alkuperäisen NSException-poikkeuksen aiheuttavan koodirivin. Lisätietoja siitä, miten voit tehdä tämän, on dokumentaatiossa.";

/* No comment provided by engineer. */
"Apply Geometry" = "Käytä geometriaa";

/* No comment provided by engineer. */
"At least 1 facility is required to solve a route." = "Reitin selvitys edellyttää vähintään yhtä palvelua.";

/* No comment provided by engineer. */
"At least 1 incident is required to solve a route." = "Reitin selvitys edellyttää vähintään yhtä tapahtumaa.";

/* No comment provided by engineer. */
"Attachment" = "Liite";

/* No comment provided by engineer. */
"Attachments" = "Liitteet";

/* No comment provided by engineer. */
"Attempt to use functionality that is not supported for the current license level" = "On yritetty käyttää toimintoa, jota nykyinen lisenssitaso ei tue";

/* No comment provided by engineer. */
"Authorization required" = "Todennus vaaditaan";

/* No comment provided by engineer. */
"Bad Request" = "Virheellinen pyyntö";

/* No comment provided by engineer. */
"Bad URL." = "Virheellinen URL.";

/* No comment provided by engineer. */
"bytes" = "tavua";

/* No comment provided by engineer. */
"Cancel" = "Peruuta";

/* No comment provided by engineer. */
"Cannot save to a different item type." = "Ei voi tallentaa eri kohdetyyppiin.";

/* No comment provided by engineer. */
"Cannot verify the identity of '%@'" = "Kohteen %@ tunnistusta ei voi todentaa";

/* No comment provided by engineer. */
"Certificate Required" = "Varmenne vaaditaan";

/* No comment provided by engineer. */
"Challenge for URL: %@ with failureCount: %lu" = "URL-osoitteen haaste: %1$@ with failureCount: %2$lu";

/* No comment provided by engineer. */
"Changing Feature Type" = "Vaihdetaan kohdetyyppiä";

/* No comment provided by engineer. */
"Choose From Library" = "Valitse kirjastosta";

/* No comment provided by engineer. */
"Clear" = "Tyhjennä";

/* No comment provided by engineer. */
"Clear Geometry" = "Tyhjennä geometria";

/* No comment provided by engineer. */
"Continue" = "Jatka";

/* No comment provided by engineer. */
"Created %d hours ago" = "Luotu %d tuntia sitten";

/* No comment provided by engineer. */
"Created %d minutes ago" = "Luotu %d minuuttia sitten";

/* No comment provided by engineer. */
"Created a minute ago" = "Luotu minuuttia sitten";

/* No comment provided by engineer. */
"Created an hour ago" = "Luotu tunti sitten";

/* No comment provided by engineer. */
"Created by %@" = "Luonut %@";

/* No comment provided by engineer. */
"Created by %@ %d hours ago" = "Luonut %1$@, %2$d tuntia sitten";

/* No comment provided by engineer. */
"Created by %@ %d minutes ago" = "Luonut %1$@, %2$d minuuttia sitten";

/* No comment provided by engineer. */
"Created by %@ a minute ago" = "Luonut %@, minuutti sitten";

/* No comment provided by engineer. */
"Created by %@ an hour ago" = "Luonut %@, tunti sitten";

/* No comment provided by engineer. */
"Created by %@ on %@ at %@ - day" = "Luonut %1$@, %2$@ klo %3$@ – päivä";

/* No comment provided by engineer. */
"Created by %@ on %@ at %@ - full" = "Luonut %1$@, %2$@ klo %3$@ – täysi";

/* No comment provided by engineer. */
"Created by %@ seconds ago" = "Luonut %@, sekunteja sitten";

/* No comment provided by engineer. */
"Created on %@ at %@ - day" = "Luotu %1$@ klo %2$@ – päivä";

/* No comment provided by engineer. */
"Created on %@ at %@ - full" = "Luotu %1$@ klo %2$@ – täysi";

/* No comment provided by engineer. */
"Created seconds ago" = "Luotu sekuntia sitten";

/* No comment provided by engineer. */
"Credential Required" = "Tunnistetiedot vaaditaan";

/* No comment provided by engineer. */
"Data for pie chart is invalid" = "Piirakkakaavion tiedot eivät kelpaa";

/* No comment provided by engineer. */
"Delete" = "Poista";

/* No comment provided by engineer. */
"Delete Attachment" = "Poista liite";

/* No comment provided by engineer. */
"Delete Feature" = "Poista kohde";

/* No comment provided by engineer. */
"Deleting this attachment will remove it from the popup and associated data source." = "Tämän liitteen poistaminen poistaa sen ponnahdusikkunasta ja siihen liittyvästä aineistolähteestä.";

/* No comment provided by engineer. */
"Deleting this feature will remove it from the map and associated data source." = "Tämän kohteen poistaminen poistaa sen kartasta ja siihen liittyvästä aineistolähteestä.";

/* No comment provided by engineer. */
"Directions distance attribute is invalid." = "Reittiohjeiden etäisyyden ominaisuustieto on virheellinen.";

/* No comment provided by engineer. */
"Directions time and distance attributes do not match." = "Reittiohjeiden aika- ja etäisyysominaisuustiedot eivät täsmää.";

/* No comment provided by engineer. */
"Edit" = "Muokkaa";

/* No comment provided by engineer. */
"Edited %d hours ago" = "Muokattu %d tuntia sitten";

/* No comment provided by engineer. */
"Edited %d minutes ago" = "Muokattu %d minuuttia sitten";

/* No comment provided by engineer. */
"Edited a minute ago" = "Muokattu minuuttia sitten";

/* No comment provided by engineer. */
"Edited an hour ago" = "Muokattu tunti sitten";

/* No comment provided by engineer. */
"Edited by %@" = "Muokannut %@";

/* No comment provided by engineer. */
"Edited by %@ %d hours ago" = "Muokannut %1$@, %2$d tuntia sitten";

/* No comment provided by engineer. */
"Edited by %@ %d minutes ago" = "Muokannut %1$@, %2$d minuuttia sitten";

/* No comment provided by engineer. */
"Edited by %@ a minute ago" = "Muokannut %@ minuutti sitten";

/* No comment provided by engineer. */
"Edited by %@ an hour ago" = "Muokannut %@, tunti sitten";

/* No comment provided by engineer. */
"Edited by %@ on %@ at %@ - day" = "Muokannut %1$@, %2$@ klo %3$@ – päivä";

/* No comment provided by engineer. */
"Edited by %@ on %@ at %@ - full" = "Muokannut %1$@, %2$@ klo %3$@ – täysi";

/* No comment provided by engineer. */
"Edited by %@ seconds ago" = "Muokannut %@, sekunteja sitten";

/* No comment provided by engineer. */
"Edited on %@ at %@ - day" = "Muokannut %1$@ klo %2$@ – päivä";

/* No comment provided by engineer. */
"Edited on %@ at %@ - full" = "Muokannut %1$@ klo %2$@ – täysi";

/* No comment provided by engineer. */
"Edited seconds ago" = "Muokattu sekuntia sitten";

/* No comment provided by engineer. */
"Empty username/password" = "Tyhjä käyttäjätunnus/salasana";

/* No comment provided by engineer. */
"Enter a number between %@ and %@" = "Kirjoita jokin numero %1$@–%2$@";

/* No comment provided by engineer. */
"Enter a number between %i and %i" = "Kirjoita jokin numero %1$i–%2$i";

/* No comment provided by engineer. */
"Error" = "Virhe";

/* No comment provided by engineer. */
"Error adding identity to the keychain" = "Virhe lisättäessä identiteettiä avainketjuun";

/* No comment provided by engineer. */
"Error adding keychain item" = "Virhe avainketjun kohteen lisäyksessä";

/* No comment provided by engineer. */
"Error extracting identity" = "Virhe haettaessa identiteettiä";

/* No comment provided by engineer. */
"Error Loading Page" = "Virhe sivun latauksessa";

/* No comment provided by engineer. */
"Error removing keychain item" = "Virhe avainketjun kohteen poistossa";

/* No comment provided by engineer. */
"Error updating keychain item" = "Virhe avainketjun kohteen päivityksessä";

/* No comment provided by engineer. */
"Extra Large" = "Erittäin suuri";

/* No comment provided by engineer. */
"Facility (%@) has invalid added cost attribute name(s): %@" = "Palveluun (%1$@) on lisätty virheellisiä kustannusominaisuustietojen nimiä: %2$@";

/* No comment provided by engineer. */
"Facility (%@) has invalid impedance cutoff." = "Palvelussa (%@) on virheellinen impedanssin raja-arvo.";

/* No comment provided by engineer. */
"Facility (%@) has negative added cost attribute: %@" = "Palveluun (%1$@) on lisätty negatiivinen kustannusominaisuustieto: %2$@";

/* No comment provided by engineer. */
"Facility (%@) has null geometry." = "Palvelussa (%@) on tyhjäarvoinen geometria.";

/* No comment provided by engineer. */
"Feature isn't valid." = "Kohde ei kelpaa.";

/* No comment provided by engineer. */
"Finish" = "Valmis";

/* No comment provided by engineer. */
"Finishing editing..." = "Lopetetaan muokkausta...";

/* No comment provided by engineer. */
"GB" = "Gt";

/* No comment provided by engineer. */
"Geometry" = "Geometria";

/* No comment provided by engineer. */
"Hide" = "Piilota";

/* No comment provided by engineer. */
"Incident (%@) has a null geometry." = "Tapahtumassa (%@) on tyhjäarvoinen geometria.";

/* No comment provided by engineer. */
"Incident (%@) has invalid added cost attribute name(s): %@" = "Tapahtumaan (%1$@) on lisätty virheellisiä kustannusominaisuustietojen nimiä: %2$@";

/* No comment provided by engineer. */
"Incident (%@) has invalid impedance cutoff." = "Tapahtumassa (%@) on virheellinen impedanssin raja-arvo.";

/* No comment provided by engineer. */
"Incident (%@) has less than 1 target facility count." = "Tapahtuman (%@) kohdepalvelujen määrä on alle 1.";

/* No comment provided by engineer. */
"Incident (%@) has negative added cost attribute: %@" = "Tapahtumaan (%1$@) on lisätty negatiivinen kustannusominaisuustieto: %2$@";

/* No comment provided by engineer. */
"Insert Part" = "Lisää osa";

/* No comment provided by engineer. */
"Insert Vertex" = "Lisää taitepiste";

/* No comment provided by engineer. */
"Insufficient number of stops." = "Pysähdysten määrä ei riitä.";

/* No comment provided by engineer. */
"Invalid attribute parameter attribute name (%@)." = "Virheellinen ominaisuustietoparametrin ominaisuustiedon nimi (%@).";

/* No comment provided by engineer. */
"Invalid attribute parameter parameter name (%@)." = "Virheellinen ominaisuustietoparametrin parametrin nimi (%@).";

/* No comment provided by engineer. */
"Invalid Credentials" = "Virheelliset tunnukset";

/* No comment provided by engineer. */
"Invalid default impedance cutoff." = "Virheellinen oletusarvoinen impedanssin raja-arvo.";

/* No comment provided by engineer. */
"Invalid default target facility count." = "Virheellinen oletusarvoinen kohdepalvelujen määrä.";

/* No comment provided by engineer. */
"Invalid GPX data." = "Virheellinen GPX-aineisto.";

/* No comment provided by engineer. */
"Invalid groupID." = "Virheellinen ryhmätunnus.";

/* No comment provided by engineer. */
"Invalid polygon buffer distance." = "Virheellinen aluepuskurin etäisyys.";

/* No comment provided by engineer. */
"Invalid restriction usage value for attribute (%1$@) parameter (%2$@)." = "Virheellinen rajoituksen käytön arvo ominaisuustiedon (%1$@) parametrille (%2$@).";

/* No comment provided by engineer. */
"Invalid value type for attribute (%1$@) parameter (%2$@)." = "Virheellinen arvotyyppi ominaisuustiedon (%1$@) parametrille (%2$@).";

/* No comment provided by engineer. */
"KB" = "kt";

/* No comment provided by engineer. */
"Keep Current Values" = "Säilytä nykyiset arvot";

/* No comment provided by engineer. */
"Large" = "Suuri";

/* No comment provided by engineer. */
"Line barrier (%@) does not cover any network elements." = "Viivaeste (%@) ei peitä yhtään verkon elementtiä.";

/* No comment provided by engineer. */
"Line barrier (%@) has invalid scaled cost attribute name." = "Viivaesteen (%@) skaalatun haittapisteen ominaisuustiedon nimi on virheellinen.";

/* No comment provided by engineer. */
"Loading feature..." = "Ladataan kohdetta...";

/* No comment provided by engineer. */
"MB" = "Mt";

/* No comment provided by engineer. */
"Medium" = "Keskisuuri";

/* No comment provided by engineer. */
"Missing client certificate" = "Asiakasvarmenne puuttuu";

/* string to represent hyperlink attributes */
"More Info" = "Lisätietoja";

/* No comment provided by engineer. */
"Move Geometry" = "Siirrä geometria";

/* No comment provided by engineer. */
"Move Part" = "Siirrä osa";

/* No comment provided by engineer. */
"Move Vertex" = "Siirrä taitepiste";

/* No comment provided by engineer. */
"Neutral restriction usage value for attribute (%1$@) parameter (%2$@)." = "Neutraali rajoituksen käytön arvo ominaisuustiedon (%1$@) parametrille (%2$@).";

/* No comment provided by engineer. */
"No certificate found to access the resource '%@'" = "Resurssin %@ käyttöön tarvittavaa varmennetta ei löydy";

/* No comment provided by engineer. */
"No data to create a bar chart" = "Ei tietoja palkkikaavion luomiseen";

/* No comment provided by engineer. */
"No data to create a line chart" = "Ei tietoja viivakaavion luomiseen";

/* No comment provided by engineer. */
"No data to create a pie chart" = "Ei tietoja piirakkakaavion luomiseen";

/* No comment provided by engineer. */
"No image to display" = "Yhtään näytettävää kuvaa ei ole";

/* No comment provided by engineer. */
"No path can be found between a given pair of stops (%@)." = "Annetun kohdeparin välille ei löydy polkua (%@).";

/* No comment provided by engineer. */
"Object cannot be created without a portal.  Use fromJSON:withPortal:error: method instead." = "Objektia ei voi luoda ilman portaalia. Käytä sen sijaan metodia fromJSON:withPortal:error:.";

/* No comment provided by engineer. */
"OK" = "OK";

/* No comment provided by engineer. */
"Open" = "Avaa";

/* No comment provided by engineer. */
"Open in Safari" = "Avaa Safarissa";

/* No comment provided by engineer. */
"Password" = "Salasana";

/* No comment provided by engineer. */
"Please enter a name for the new attachment" = "Anna uuden liitteen nimi";

/* No comment provided by engineer. */
"Point barrer (%@) was not located." = "Piste-estettä (%@) ei paikannettu.";

/* No comment provided by engineer. */
"Point barrier (%@) has invalid added cost attribute name." = "Piste-esteen (%@) lisähaittapisteen ominaisuustiedon nimi on virheellinen.";

/* No comment provided by engineer. */
"Point barrier (%@) has null geometry." = "Piste-esteen (%@) geometria on tyhjäarvoinen.";

/* No comment provided by engineer. */
"Polygon barrier (%@) does not cover any network elements." = "Alue-este (%@) ei peitä yhtään verkon elementtiä.";

/* No comment provided by engineer. */
"Polygon barrier (%@) has invalid scaled cost attribute name." = "Alue-esteen (%@) skaalatun haittapisteen ominaisuustiedon nimi on virheellinen.";

/* No comment provided by engineer. */
"Polygon barrier (%@) has non positive scaled cost attribute." = "Alue-esteen (%@) kustannusominaisuustiedon asteikko on negatiivinen.";

/* No comment provided by engineer. */
"Polygon barrier (%@) has null geometry." = "Alue-esteen (%@) geometria on tyhjäarvoinen.";

/* No comment provided by engineer. */
"Polyline barrier (%@) has non positive scaled cost attribute." = "Taiteviivaesteen (%@) kustannusominaisuustiedon asteikko on negatiivinen.";

/* No comment provided by engineer. */
"Polyline barrier (%@) has null geometry." = "Taiteviivaesteen (%@) geometria on tyhjäarvoinen.";

/* No comment provided by engineer. */
"Polylines cannot be returned." = "Taiteviivoja ei voi palauttaa.";

/* No comment provided by engineer. */
"Remove Part" = "Poista osa";

/* No comment provided by engineer. */
"Remove Vertex" = "Poista taitepiste";

/* No comment provided by engineer. */
"Reset to Default Values" = "Palauta oletusarvoihin";

/* No comment provided by engineer. */
"Retry" = "Yritä uudelleen";

/* No comment provided by engineer. */
"Save To Photo Library" = "Tallenna valokuvakirjastoon";

/* No comment provided by engineer. */
"Sign In" = "Kirjaudu sisään";

/* No comment provided by engineer. */
"Skip" = "Ohita";

/* No comment provided by engineer. */
"Small" = "Pieni";

/* No comment provided by engineer. */
"Soft restricted element (%@) was traversed." = "Pehmeän rajoituksen elementin (%@) läpi kuljettiin.";

/* No comment provided by engineer. */
"Specified start time occurs before January 1, 1970." = "Määritetty aloitusaika on ennen 1.1.1970.";

/* No comment provided by engineer. */
"Stop (%@) has a time window end that occurs before its time window start." = "Pysähdyksen (%@) aikaikkunan lopetus on ennen aikaikkunan aloitusta.";

/* No comment provided by engineer. */
"Stop (%@) has a time window that starts before January 1, 1970." = "Pysähdyksen (%@) aikaikkuna alkaa ennen 1.1.1970.";

/* No comment provided by engineer. */
"Stop (%@) has invalid added cost." = "Pysähdykseen (%@) lisätty kustannus on virheellinen.";

/* No comment provided by engineer. */
"Stop (%@) has null geometry." = "Pysähdyksessä (%@) on tyhjäarvoinen geometria.";

/* No comment provided by engineer. */
"Stop (%@) is located on a non traversable element." = "Pysähdys (%@) sijaitsee elementissä, jonka läpi ei voi kulkea.";

/* No comment provided by engineer. */
"Stop (%@) is located on a soft restricted element." = "Pysähdys (%@) sijaitsee pehmeän rajoituksen elementissä.";

/* No comment provided by engineer. */
"Stop (%@) is unreachable." = "Pysähdys (%@) ei ole käytettävissä.";

/* No comment provided by engineer. */
"Stop (%@) was not located." = "Pysähdystä (%@) ei paikannettu.";

/* No comment provided by engineer. */
"Take Photo or Video" = "Ota valokuva tai video";

/* No comment provided by engineer. */
"The directions language is invalid." = "Reittiohjeiden kieli on virheellinen.";

/* No comment provided by engineer. */
"The directions road class attribute is invalid." = "Reittiohjeiden tieluokan ominaisuustieto on virheellinen.";

/* No comment provided by engineer. */
"The directions style is invalid." = "Reittiohjeiden tyyli on virheellinen.";

/* No comment provided by engineer. */
"The input spatial reference is undefined." = "Lähtökoordinaatistotietoja ei ole määritetty.";

/* No comment provided by engineer. */
"The network does not have a hierarchy attribute for performing hierarchical route planning." = "Verkossa ei ole hierarkiaominaisuustietoa hierarkkista reittisuunnittelua varten.";

/* No comment provided by engineer. */
"The object must first be saved to a portal using the 'saveAs:' method." = "Objekti on tallennettava ensin portaaliin metodilla saveAs:.";

/* No comment provided by engineer. */
"The output spatial reference is undefined." = "Tuloskoordinaatistotietoja ei ole määritetty.";

/* No comment provided by engineer. */
"The resource you are looking for might have been removed, had its name changed, or is temporarily unavailable" = "Etsimäsi resurssi on saatettu poistaa, resurssin nimi on saatettu vaihtaa tai resurssi on väliaikaisesti poissa käytöstä";

/* No comment provided by engineer. */
"The server’s certificate is invalid. You might be connecting to a server that is pretending to be '%@', which could put your confidential information at risk. Would you like to connect anyway?" = "Palvelinsertifikaatti on virheellinen. Olet ehkä muodostamassa yhteyttä palvelimeen, joka väittää olevansa %@. Tämä voi vaarantaa luottamukselliset tietosi. Haluatko silti muodostaa yhteyden?";

/* No comment provided by engineer. */
"The specified clientID is invalid" = "Määritetty työasematunnus on virheellinen";

/* No comment provided by engineer. */
"The walking mode route is too large." = "Kävelytilan reitti on liian laaja.";

/* No comment provided by engineer. */
"There was an error loading the feature. Please check your network connectivity." = "Kohteen latauksessa on ilmennyt virhe. Tarkista verkkoyhteytesi.";

/* No comment provided by engineer. */
"Time windows with non time impedance." = "Aikaikkunat, joiden impedanssi perustuu muuhun kuin aikaan.";

/* No comment provided by engineer. */
"To save as a new item, you must be logged in to the portal." = "Jotta voit tallentaa kohteen uutena kohteena, sinun on kirjauduttava portaaliin.";

/* No comment provided by engineer. */
"Today" = "Tänään";

/* No comment provided by engineer. */
"Token is invalid or has expired" = "Tunnus on väärä tai on vanhentunut";

/* No comment provided by engineer. */
"Token URL is nil. You must set a valid token URL on the credential." = "Tunnuksen URL on tyhjä. Määritä varmenteeseen kelvollinen tunnuksen URL.";

/* No comment provided by engineer. */
"Unauthorized access" = "Luvaton käyttö";

/* No comment provided by engineer. */
"Unknown authentication error" = "Tuntematon todennusvirhe";

/* No comment provided by engineer. */
"Unknown condition." = "Tuntematon ehto.";

/* No comment provided by engineer. */
"Unknown error occurred" = "Tuntematon virhe";

/* No comment provided by engineer. */
"Unsupported GPX data." = "GPX-aineistoa ei tueta.";

/* No comment provided by engineer. */
"Unsupported search where clause." = "Haun where-lausetta ei tueta.";

/* No comment provided by engineer. */
"User canceled error" = "Käyttäjä peruutti -virhe";

/* No comment provided by engineer. */
"Username" = "Käyttäjätunnus";

/* No comment provided by engineer. */
"Using browser to authenticate..." = "Käytetään selainta todentamiseen...";

/* No comment provided by engineer. */
"Value exceeds maximum field length of %lu" = "Arvo ylittää kentän enimmäispituuden, joka on %lu";

/* No comment provided by engineer. */
"You are changing the feature type. Would you like to keep your current values (where possible) or reset to defaults?" = "Olet muuttamassa kohteen tyyppiä. Haluatko säilyttää nykyiset arvot (jos mahdollista) vai palauttaa oletusarvot?";

/* No comment provided by engineer. */
"You do not have permissions to access this resource" = "Sinulla ei ole oikeuksia tämän resurssin käyttämiseen";

/* No comment provided by engineer. */
"You must be logged in to the Portal to perform this operation." = "Tämän toiminnon suorittaminen edellyttää portaaliin kirjautumista.";

/* No comment provided by engineer. */
"You must be specify a rating between 1 and 5." = "Määritä arvioksi 1–5.";

/* No comment provided by engineer. */
"You must specify a location usage description key (NSLocationWhenInUseUsageDescription or NSLocationAlwaysUsageDescription) in your plist." = "Määritä sijaintitietojen käytön kuvausavain (NSLocationWhenInUseUsageDescription tai NSLocationAlwaysUsageDescription) plist-tiedostoon.";

/* No comment provided by engineer. */
"You need to select a certificate to access the resource '%@'" = "Sinun on valittava varmenne, jotta voit käyttää resurssia %@";

/* No comment provided by engineer. */
"You need to sign in to access the resource '%@'" = "Sinun on kirjauduttava sisään, jotta voit käyttää resurssia %@";

/* No comment provided by engineer. */
"• " = "• ";

﻿/* Localizable+Additions.strings */

/* Unit Abbreviated strings */
"cm" = "cm";
"dd" = "dd";
"dm" = "dm";
"ft" = "ft";
"in" = "tuuma";
"km" = "km";
"m" = "m";
"mi" = "mi";
"mm" = "mm";
"nm" = "mpk";
"pt" = "pt";
"Unknown" = "Tuntematon";
"yd" = "yd";

/* Unit Display Strings */
"Centimeters" = "Senttimetriä";
"Decimal Degrees" = "Desimaaliastetta";
"Decimeters" = "Desimetriä";
"Feet" = "Jalkaa";
"Inches" = "Tuumaa";
"Kilometers" = "Kilometriä";
"Meters" = "Metriä";
"Miles" = "Mailia";
"Millimeters" = "Millimetriä";
"Nautical Miles" = "Meripeninkulmaa";
"Points" = "Pistettä";
"Yards" = "Jaardia";

/* Area Units Abbreviated Strings */
"sq. in" = "sq. in";
"sq. ft" = "sq. ft";
"sq. yd" = "sq. yd";
"ac" = "ac";
"sq. mi" = "sq. mi";
"sq. mm" = "mm2";
"sq. cm" = "cm2";
"sq. dm" = "dm2";
"sq. m" = "m2";
"ares" = "a";
"ha" = "ha";
"sq. km" = "km2";

/* Area Units Display Strings */
"Square Inches" = "Neliötuumaa";
"Square Feet" = "Neliöjalkaa";
"Square Yards" = "Neliöjaardia";
"Acres" = "Eekkeriä";
"Square Miles" = "Neliömailia";
"Square Millimeters" = "Neliömillimetriä";
"Square Centimeters" = "Neliösenttimetriä";
"Square Decimeters" = "Neliödesimetriä";
"Square Meters" = "Neliömetriä";
"Ares" = "Aaria";
"Hectares" = "Hehtaaria";
"Square Kilometers" = "Neliökilometriä";

